PC0: 
-click on pc0 (network address: 10.0.0.0)
-go to ip configuration
-set ip address: 10.0.0.2
-subnet mask: 255.0.0.0
-default gateway: 10.0.0.1

PC1:
-click on pc0 (network address: 11.0.0.0)
-go to ip configuration
-set ip address: 11.0.02
-subnet mask: 255.0.0.0
-default gateway: 11.0.0.1

ROUTER 0(above pc0)
-enable
-config terminal
-interface gig0/0/0
-ip address 10.0.0.1 255.0.0.0
-no shutdown
-exit
-interface gig0/0/1
-ip address 12.0.0.1 255.0.0.0
-no shutdown
-exit

ROUTER 1(above pc1)
-enable
-config terminal
-interface gig0/0/0
-ip address 12.0.0.2 255.0.0.0
-no shutdown
-exit
-interface gig0/0/1
-ip address 11.0.0.1 255.0.0.0
-no shutdown
-exit

  COMMAND FOR DYNAMIC ROUTING

USING RIP COMMAND:

ROUTER 0
Router0(config)#router rip
           #version 2
            #network 10.0.0.0
             #network 12.0.0.0

ROUTER 1
Router1(config)#router rip
           #version 2
            #network 11.0.0.0
             #network 12.0.0.0

  
USING OSPF COMMAND:

ROUTER 0:
ROUTER0(CONFIG)#router ospf 1
  #network 10.0.0.0   0.255.255.255   area 0
  #network 12.0.0.0   0.255.255.255   area 0

ROUTER 1:
ROUTER1(CONFIG)#router ospf 1
  #network 11.0.0.0   0.255.255.255   area 0
  #network 12.0.0.0   0.255.255.255   area 0
